package Study;

public class jQuery_220103 {
	/*
	 * jQuery study 시작 그 전에도 많은걸 배웠고 남겻지만 github에 올릴땐 좀 깔끔하게 올리고 싶어서 이걸로 올립니다.
	 * 
	 * 여기 파일에서는 되도록 이론적인 것들만 남기려고 하기때문에 다른 부분이 있다면 repository 다시 만들어서 할 예쩡
	 * 
	 * 제이쿼리 jquery는 자바스크립 언어를 간편하게 사용하루 있도록 단순화 시킨 오픈소스 기반의 자바스크립트 라이브러리 입니다. 제이쿼리를
	 * 이용하면 문서 객체모델 dom 과 이벤트에 관한 처리를 손쉽게 구현할수 있습니다., 또한 ajax 응용 프로그램 및 플러그인도 제이쿼리를
	 * 활용하여 빠르게 개발할 수 있습니다.
	 * 
	 * 수많은 자바스크립 라이브러리 중에서도 제이쿼리가 특히 많이 사용되는 이유는 다음과 같습니다. 제이쿼리는 주요 웹브라우저의 구버전을 포함한
	 * 대부분의 브라우저에서 지원됩니다. html dom을 손쉽게 조작할 수있으며, css스타일도 간단히 적용할 수 있습니다. 애니메이션 효과나
	 * 대화형 처리를 간단하게 적용해 줍니다. 가은 동작을 하는 프로그램을 더욱 짧은 코드로 구현할 수 있습니다. 다양한 플러그인과 참고할 수있는
	 * 문서가 많이 존재합니다. 오픈 라이선스를 적용하여 누구나 자유롭게 사용할수 잇씁니다.
	 * 
	 * 
	 * 제이쿼리 로드하는 방법 <head>
	 * 
	 * <script
	 * src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></
	 * script>
	 * 
	 * </head>
	 * 
	 * 제이쿼리 문법 제이쿼리를 사용하면 아주 간편하게 HTML 요소를 선택하고, 그렇게 선택된 요소에 손쉽게 특정 동작을 설정할 수 있습니다.
	 * 
	 * 
	 * 
	 * $(선택자).동작함수() 기본 문법입니다 달러 기호는 제이쿼리를 의미하고, 제이쿼리에 접근할 수 잇게 해주는 식별자 입니다. 선택자를
	 * 이용하여 원하는 html요소를 선택하고. 동작 함수를 정의하여 선택된 요소에 원하는 동작을 설정합니다.
	 * 
	 * $() 합수의 인수로는 html태그 이름 뿐만 아니라,css선택자를 전달하여 특정 html요소를 선택할 수 잇습니다. 이러한 $()함수를
	 * 통해 생성된 요소를 제이쿼리 객체 (jquery object)라고 합니다.
	 * 
	 * 
	 * Document 객체의 ready() 메소드 자바스크립트 코드는 웹 브라우저가 문서의 모든 요소를 로드한 뒤에 실행되어야 합니다.
	 * 
	 * 제이쿼리에서는 Document 객체의 ready() 메소드를 이용하여 같은 결과를 보장하고 있습니다.
	 * 
	 * $(document).ready(function() {
	 * 
	 * 제이쿼리 코드;
	 * 
	 * });
	 * 
	 * 
	 */

}
